/***************************Copyright BestFu 2014-05-14*************************
文	件：    singleUnit.c
说	明：    单路执行器驱动实现文件
编	译：    Keil uVision4 V4.54.0.0
版	本：    v1.0
编	写：    Unarty
日	期：    2014.08.20
修　改：	暂无
*******************************************************************************/
#include "SingleDrive.h"
#include "singleunit.h"
#include "Thread.h"


SigActTime_t gSigActTime;	//开关动作定时动作变量

/*******************************************************************************
函 数 名:  	SingleUnit_Init
功能说明: 	初始化单路的某个单元
参    数:  	unit:	单元号			
返 回 值:  	无
*******************************************************************************/
void SingleUnit_Init(u8 unit)
{
	SingleDrive_Init();
}

/*******************************************************************************
函 数 名:  	Single_ON
功能说明: 	开
参    数:  	无		
返 回 值:  	无
*******************************************************************************/
void Single_ON(void)
{
	SIG_ON;	
}

/*******************************************************************************
函 数 名:  	Single_ON
功能说明: 	关
参    数:  	无		
返 回 值:  	无
*******************************************************************************/
void Single_OFF(void)
{
	SIG_OFF;	
}

/*******************************************************************************
函 数 名:  	Single_Rvrs
功能说明: 	当前状态取反
参    数:  	无		
返 回 值:  	无
*******************************************************************************/
void Single_Rvrs(void)
{
	SIG_RVRS;	
}

/*******************************************************************************
函 数 名:  	Single_State
功能说明: 	当前状态
参    数:  	无		
返 回 值:  	TRUE(开）/ FALSE(关）
*******************************************************************************/
u8 Single_State(void)
{
	return (SIG_STATUS != 0 ? TRUE : FALSE);
}

/*******************************************************************************
函 数 名:  	Single_DelayClr
功能说明: 	开关延时事件清空
参    数:  	无		
返 回 值:  	无
*******************************************************************************/
void Single_DelayClr(void)
{
	Thread_Logout(gSigActTime.fun);
	Thread_Logout(&Single_DelayOpt1);
	Thread_Logout(&Single_DelayOpt2);		//清空所有开关延时操作线程
	
	gSigActTime.fun = &Single_OFF;	
	gSigActTime.cycleFlag = 0;
	gSigActTime.firstTime = 0;
	gSigActTime.secondTime = 0;
}

/*******************************************************************************
函 数 名:  	Single_DelayOpt1
功能说明: 	开关延时操作1
参    数:  	无		
返 回 值:  	无
*******************************************************************************/
void Single_DelayOpt1(void)
{
	((fun1)(gSigActTime.fun))();
	if (0 != gSigActTime.secondTime)	//保持一段时间后关闭
	{
		Thread_Login(ONCEDELAY, 0, gSigActTime.secondTime, &Single_DelayOpt2);
	}
}

/*******************************************************************************
函 数 名:  	Single_DelayOpt2
功能说明: 	开关延时操作2
参    数:  	无		
返 回 值:  	无
*******************************************************************************/
void Single_DelayOpt2(void)
{
	Single_Rvrs();	//取反当前状态
	
	if (0 != gSigActTime.cycleFlag)		//操作循环
	{
		Thread_Login(ONCEDELAY, 0, gSigActTime.firstTime, &Single_DelayOpt1);
	}
}
/**************************Copyright BestFu 2014-05-14*************************/
