/***************************Copyright BestFu 2014-05-14*************************
文	件：    singleUnit.c
说	明：    单路执行器驱动实现文件
编	译：    Keil uVision4 V4.54.0.0
版	本：    v1.0
编	写：    Unarty
日	期：    2014.08.20
修　改：	暂无
*******************************************************************************/
#include "SingleDrive.h"

/*******************************************************************************
函 数 名:  	SingleDrive_Init
功能说明: 	初始化单路执行器硬件初始化
参    数:  	无 			
返 回 值:  	无
*******************************************************************************/
void SingleDrive_Init(void)
{
	GPIOx_Cfg(SIG_PORT, SIG_PIN, OUT_PP_10M);	//PB9 输出，	  
	SIG_OFF;
}


/**************************Copyright BestFu 2014-05-14*************************/
